[{"name": "TheHonestshopper", "rating_review": 5, "date": "2018-02-05T00:00:00Z", "verified": true, "title_review": "Great phone at a great price", "body": "Ok. Where do I begin. The battery oh.... The battery!!! A 3,900 mAh offering good for 2 days on a moderate to heavy usage. I simply have too say; I started at 8:30am at 100% and it is currently 7:51pm on February 5th when I'm doing this review and I have 56% left, with close to 4hrs ost(on-screen-time)with some web browsing, listening to music, lots of texting, no games, no videos, brightness at about 20%. The performance is above average, at 3 yrs old still in 2018 this thing is a BEAST going strong with lots of fluidity and no lags once so ever!!! Apps open up quick with ease. Build quality is study, but when you turn it over there when u discover heaven. Has a very unique design that feels good in the hands made from a fabric called \"ballistic nylon supposed to be very strong and sturdy and so far it's stands by its claim. A 21 mp camera that takes decent pictures in good light, not recommended in low light but if you can get the updates up and going that should take care of the cameras software. Very good camera nonetheless. Here are some ratings that hopefully help you guys out to buy this phone 👇👇 PERFORMANCE: 9.5/10 BATTERY:10/10👍👍(almost 2 days on a single charge) BUILD:8/10(great feel) CAMERA: 8.5/10 (21mp)", "helpfulVotes": 27, "country": "United States", "id": "B00OZTSY6Y-r0", "content_type": "review", "_version_": 1722131221189754880, "asin": "B00OZTSY6Y"}, {"name": "Matt", "rating_review": 5, "date": "2019-05-29T00:00:00Z", "verified": true, "title_review": "Great value. Good phone. Works on AT&T", "body": "Only had 1 day but initial impressions are great. Have AT&T, no issues connecting or with calls/texts or updates. Switched from S8+ and it's definitely a step up, although the UI is just different enough to take some getting used to. Camera is great. Most Importantly: it works with AT&T plug and play, removed SIM from old phone and or into Pixel 3xl and it picked right up. No issues! Call/text/mms functioning No Verizon icon on boot screen All apps work System updates no problem Phone was last fully charged 104 days ago Has minor scratch on screen and in corners, annoying, but worth not paying full price for", "helpfulVotes": 14, "country": "United States", "id": "B07HKPMFZ5-r17", "content_type": "review", "_version_": 1722131220867842048, "asin": "B07HKPMFZ5"}, {"name": "Les H", "rating_review": 5, "date": "2019-03-28T00:00:00Z", "verified": true, "title_review": "A great phone from a great seller!", "body": "I researched the iPhone 6,7, and 8 as replacements for my aging 5s. I also sought out sellers with good ratings for this purchase. I settled on MyWit based on their reviews and their volume of sales. The phone arrived a day early and it is absolutely pristine. If it is a refurb, there are zero signs of that as there are no marks anywhere on it. Not even finger prints or dust. It came with a nice flex lighting cable and Apple charger (no sim as advertised). I put the sim card from my old iPhone 5s in it and went through the setup questions. I had a fully functional iPhone 8 in 5 minutes tops. I selected the iPhone 8 over the 6 or 7 due to the advanced technology in the 8. It is worth the extra $100 over the same size 7. It is fast but the battery lasts all day without showing significant signs of needing a charge. I also purchased a Speck Candy Shell case for this phone. The iPhone 8 has a glass back for wireless charging and it is very smooth and slick to hold. With my dry fingers, it is difficult to even use the phone so a case is necessary to give it some grip. The Speck case is a perfect, anti-slip and lots of drop and screen protection. See this case here https://www.amazon.com/Speck-Products-CandyShell-Phone-iPhone/dp/B01K094IZ8 Very pleased with the seller too and I would certainly use them for another phone purchase without question!", "helpfulVotes": 109, "country": "United States", "id": "B07753NSQZ-r0", "content_type": "review", "_version_": 1722131221509570560, "asin": "B07753NSQZ"}, {"name": "Amazon Customer", "rating_review": 5, "date": "2017-11-07T00:00:00Z", "verified": true, "title_review": "Great Seller, Great Phone", "body": "I was very hesitant about purchasing a refurbished phone because you never know what you're going to get. I was pleasantly surprised when my phone came and it was in perfect condition. I was able to put my Verizon sim card in and was able to connect and go. The only reason I chose Mango (the seller) was because of their 100% feedback for the last 6 months. The phone is great and is better than I thought it could be.", "helpfulVotes": 145, "country": "United States", "id": "B076HVSJQR-r4", "content_type": "review", "_version_": 1722131221505376256, "asin": "B076HVSJQR"}, {"name": "JisSanPinoy", "rating_review": 5, "date": "2018-06-02T00:00:00Z", "verified": true, "title_review": "Five Stars", "body": "Product is good like its new. No difference from a new one! Fast arrived on good condition", "helpfulVotes": 46, "country": "United States", "id": "B07C65MFKH-r7", "content_type": "review", "_version_": 1722131221527396353, "asin": "B07C65MFKH"}, {"name": "Jenwhipz", "rating_review": 5, "date": "2013-05-21T00:00:00Z", "verified": true, "title_review": "Great Phone!", "body": "The process of upgrading my phone was super easy! My time for a upgrade through AT&T was up so I looked on the At&T store online but at the time they didn't have the galaxy3 in stock so I checked on amazon and sure enough they had it and was cheaper than the store! The phone arrived quickly no problems setting it up. I Love the size and quality of the phone! I need a bigger screen and this is it! Easy to navigate through and it has video help through the phone to help with whatever you need. Bright and so many features i'm completely happy with it. Easy to hold and talk on it. Battery life isn't the greatest but it's not too bad I mean it is a smart phone and with apps it does tend to drain some of the battery but that doesn't bug me at all.Great phone!", "helpfulVotes": 10, "country": "United States", "id": "B00891PTQM-r4", "content_type": "review", "_version_": 1722131220616183808, "asin": "B00891PTQM"}, {"name": "REBECCA", "rating_review": 5, "date": "2021-07-16T00:00:00Z", "verified": true, "title_review": "Great purchase!", "body": "Packing was nice, phone looks brand new works great so far. Happy with my purchase. Love the warrenty as well cause you never know when buying a used phone. Was so scared to purchase but I did so far happy.", "helpfulVotes": 20, "country": "United States", "id": "B011SDYBZW-r5", "content_type": "review", "_version_": 1722131220844773376, "asin": "B011SDYBZW"}, {"name": "Frank1701a", "rating_review": 5, "date": "2018-04-11T00:00:00Z", "verified": true, "title_review": "Great Value", "body": "For the price this is an excellent phone, I bought it for my parents. The difference in speed between this phone and my iPhone SE is barely noticeable. The Nokia only comes with 8GB of memory, before I put any apps on it I noticed it had about 4.3GB of space left. I added a micro SD card even though I only put a couple of apps in the phone. It takes better looking pictures than my iPhone SE. The battery does last days on Standby, I would say about 4 days. Due to the low price it doesn't have some upscale features such as a metal back or the latest battery charging connector, still at $99 you are getting a lot of bang for your buck. I'm tempted to get a Nokia phone as a replacement for my iPhone but I really do prefer iOS over Android. Too bad you can't get iOS on Nokia.", "helpfulVotes": 36, "country": "United States", "id": "B075FLG6MV-r1", "content_type": "review", "_version_": 1722131221417295872, "asin": "B075FLG6MV"}, {"name": "Brent Marsonette", "rating_review": 5, "date": "2021-07-05T00:00:00Z", "verified": true, "title_review": "A great buy!", "body": "My apple iPhone 11 showed up in amazing condition - no scratches anywhere on the phone and the battery was in factory new condition. Absolutely no complaints about my order!", "helpfulVotes": 27, "country": "United States", "id": "B011SDYBZW-r4", "content_type": "review", "_version_": 1722131220844773376, "asin": "B011SDYBZW"}, {"name": "Zodiase", "rating_review": 5, "date": "2021-02-06T00:00:00Z", "verified": true, "title_review": "Great Pro equipment", "body": "Some things I care for a videography equipment: - HDMI input. Kind of the selling point of this device. Very easy plug & play. Viewfinding with the stunning 4K display is amazing. - Dedicated camera button and an extra shortcut button. Very handy. - Pro camera apps. The movie app has a focus shifting feature which is quite nice. - Rugged shell. I haven't tried to damage it but it feels like it's the same rugged material on my Sony cameras. - Long battery life. The battery isn't the biggest out there but I can use it almost for 2 days without charging.", "helpfulVotes": 35, "country": "United States", "id": "B08S9CGBL2-r0", "content_type": "review", "_version_": 1722131221001011200, "asin": "B08S9CGBL2"}]