[{"name": "Ferny", "rating_review": 5, "date": "2021-07-04T00:00:00Z", "verified": true, "title_review": "Me gustó la categoría Premium de Amazon", "body": "Lo pensé mucho en comprar un iPhone reacondicionado, pero me animé cuando vi esta categoría de Premium y la verdad hasta el momento no me defraudo, ya que el teléfono llego en excelentes condiciones estéticas, 0 rayones en pantalla y body, en cuanto al funcionamiento todo va de maravilla en los 7 días que llevo con el, y si te preguntas cómo me fue con la batería?,me llego con un 98% de vida, así que estoy realmente en cantado!!!, además trae 90 días de garantía, claro que espero no usarlo. Por último actualmente estoy con la compañía telefónica Telcel y me funciona el 4G.", "helpfulVotes": 0, "country": "Mexico", "id": "B011SDYBZW-r89", "content_type": "review", "_version_": 1722131220844773376, "asin": "B011SDYBZW"}, {"name": "Hector S.", "rating_review": 5, "date": "2014-01-18T00:00:00Z", "verified": true, "title_review": "Amazing!", "body": "Even though Windows Phone 8 still has a lot of way to go, it's really a phone tan I can trust. It's stable, fast, fluid, and integrates all my Facebook, Outlook, Google and Twitter accounts. You have to go through the learning curve to squeeze out all it's potential. Regarding to the cell phone, I always have good signal reception, I only had to put my micro-SIM card inside (my company is Movistar, México) and automatically I was having 4G and my phone line back. It's a solid phone. The quality of the photos is amazing. I love it!", "helpfulVotes": 2, "country": "United States", "id": "B00CS2ZWKQ-r60", "content_type": "review", "_version_": 1722131221150957568, "asin": "B00CS2ZWKQ"}, {"name": "JuanV", "rating_review": 1, "date": "2021-02-18T00:00:00Z", "verified": true, "title_review": "Pantalla rayada con mica para cubrirlo", "body": "Ya tenía experiencia con los productos renewed pero este teléfono no cumplió con las expectativas, la pantalla venía rayada, le instalaron una mica de vidrio para cubrir los rayones y tenía pegamento alrededor de la pantalla. Me enviaron una nueva unidad igual llegó con la pantalla rayada, una mica de cristal para tapar los rayones, además de tener algo raro en el vidrio de las cámaras. Espero más adelante tengan teléfonos de otro vendedor.", "helpfulVotes": 0, "country": "Mexico", "id": "B07ZQS6LPZ-r8", "content_type": "review", "_version_": 1722131220937048064, "asin": "B07ZQS6LPZ"}, {"name": "Giulliana", "rating_review": 5, "date": "2020-11-03T00:00:00Z", "verified": true, "title_review": "Xiaomi Redmi 9S", "body": "Lo comore con ACHEMEX y me han dado excelenete servicio, les comente que el adaptador no funciono, y me enviaran un reemplazo. Buen equipo, para ser considerado gama media, es mas que excelente, a muy buen precio, se actualizo todo de inmediato, a penas unos dias, pero cero problemas, la verdad es que Xiaomi esta sacando buenos celulares y competitivos, hasta mejores que otros a mitad de precio, 100% recomendado.", "helpfulVotes": 3, "country": "Mexico", "id": "B085S47W3M-r0", "content_type": "review", "_version_": 1722131220943339520, "asin": "B085S47W3M"}, {"name": "ALBERT", "rating_review": 5, "date": "2020-06-28T00:00:00Z", "verified": true, "title_review": "Excelente compra", "body": "El celular llegó perfecto y bien empacado, incluía el adaptador del cargador, por el precio en el q lo conseguí me paracion un muy buen celular, las cámaras funcionan muy bien y por el precio creo q son de las mejores nada extraordinario pero repito por el precio muy bien, contento con el celular", "helpfulVotes": 3, "country": "Mexico", "id": "B085S47W3M-r1", "content_type": "review", "_version_": 1722131220943339520, "asin": "B085S47W3M"}, {"name": "Cliente de Amazon", "rating_review": 5, "date": "2020-12-05T00:00:00Z", "verified": true, "title_review": "Excelente compra", "body": "Estoy extremadamente satisfecho con esta compra. La estética del teléfono es de 10, la capacidad máxima de la batería indica 100% y hasta ahora su funcionamiento es excelente. El teléfono llegó sin la caja y cargador originales pero aún así le doy una calificación excelente. Definitivamente recomiendo a este vendedor.", "helpfulVotes": 0, "country": "Mexico", "id": "B07ZQS6LPZ-r7", "content_type": "review", "_version_": 1722131220937048064, "asin": "B07ZQS6LPZ"}, {"name": "Víctor Torres", "rating_review": 5, "date": "2020-12-09T00:00:00Z", "verified": true, "title_review": "Producto inmejorable, muy buena compra", "body": "Producto descrito como la publicación, prácticamente nuevo, sin ningún rasguño o defecto visible... En México funciono inmediatamente con AT&T, muy buen producto, tengo 2 días con el producto y hasta ahorita, funcionando perfectamente.", "helpfulVotes": 0, "country": "United States", "id": "B08C27KCTC-r8", "content_type": "review", "_version_": 1722131220975845376, "asin": "B08C27KCTC"}, {"name": "Cliente de Amazon", "rating_review": 1, "date": "2017-06-21T00:00:00Z", "verified": true, "title_review": "Q desepcion :)", "body": "El problema es q yo pedí un teléfono desbloqueado para usarlo con cualquier compañía pero ya lo intenté con todas y con ninguna me da red, osea no lo puedo utilizar.", "helpfulVotes": 3, "country": "Mexico", "id": "B00SIE2YQ8-r173", "content_type": "review", "_version_": 1722131220744110080, "asin": "B00SIE2YQ8"}, {"name": "Montiel", "rating_review": 4, "date": "2021-08-23T00:00:00Z", "verified": true, "title_review": "Buen Proucto", "body": "LLego la fecha que me dijieron, es unj celular que si cumple con lo que dice las descripciones, si es un equipo de media gama esta bien de precio", "helpfulVotes": 0, "country": "Mexico", "id": "B08B3VCF9G-r18", "content_type": "review", "_version_": 1722131220963262464, "asin": "B08B3VCF9G"}, {"name": "Bola Radeyo", "rating_review": 4, "date": "2014-10-28T00:00:00Z", "verified": true, "title_review": "I bought them for my nieces because they are good. You use it as in Africa", "body": "I bought one then bought another two. I bought them for my nieces because they are good. You use it as in Africa, Europe, Mexico, Poland. Good product.", "helpfulVotes": 0, "country": "United States", "id": "B00GZZTD3Y-r0", "content_type": "review", "_version_": 1722131220735721472, "asin": "B00GZZTD3Y"}]