[{"name": "Tia", "rating_review": 4, "date": "2020-11-16T00:00:00Z", "verified": false, "title_review": "Great Storage and Durability", "body": "I've been using the Galaxy series for several years now (specifically the J series) and while I loved the features and user friendly interface, the phones didnt stand up to time tech wise. I switched to the S series under recommendation from a friend and have been using it a few months now after receiving one as a gift. Here are my thoughts Pros: -Hands down, this model cant be beat in storage. If you are like me and like to have several different apps for freelance purposes (along with a million pictures of your kids), this phone is your best friend. -The camera has a lot more features and clarity than the J series and less blur to the photos. -The enhanced maintqience features really help keep this phone in tip top shape, especially If used regularly. -Pretty decent battery life. I can run Pokekon GO along with several other apps for alseveral hours without my battery dying or overheating. -The screen is pretty dang resilient. I've not yet been able to find a screen protector that works for me and have dropped this several times and have yet to crack the screen. -Considering what you are getting out if this phone, the price is really pretty good. Cons: - the slight curve to the screen makes finding a screen protector incredibly difficult. I have gone through several that never stuck for more than 24 hours. -i find that the interface is just slightly less user friendly than previous editions, but it may be more of a personal preference. -there is no manual home button, just a touch screen button, which can take some adjusting to. Overall, so far this is the best phone I've had. I give it 4 stars simply because the curve of the phone has made it nearly impossible to find a screen protector, which I feel is essential when using your phone as I do for business.", "helpfulVotes": 1, "country": "United States", "id": "B076M9RQJ2-r366", "content_type": "review", "_version_": 1722131200173146112, "asin": "B076M9RQJ2"}, {"name": "Ben Pham", "rating_review": 1, "date": "2020-11-18T00:00:00Z", "verified": true, "title_review": "Terrible Battery Life and touch screen", "body": "Bought this renewal product as a gift. It came in 2 days (Nov 16 to Nov 18) but item is not as the description. It was advertised as battery exceed 80% (This product will have a battery which exceeds 80% capacity relative to new) but it was exactly at 80% which means I have to replace a new battery eventually which costs another $80-$100. The screen freezes off a lot of time and one one point, only the home button works. I have to do hard reset to make it coming back to usual. Trying to call customer services but no one available, emailing them is no help. I regret to buy this. Now I have to take time to return plus I need to find a different one in 2 days. Horrible experience", "helpfulVotes": 1, "country": "United States", "id": "B0775MV9K2-r184", "content_type": "review", "_version_": 1722131200491913216, "asin": "B0775MV9K2"}, {"name": "Carol L Hunn", "rating_review": 5, "date": "2021-01-08T00:00:00Z", "verified": true, "title_review": "Great budget phone", "body": "I bought this mostly because I had an Amazon gift card and didn't want to spend a lot of money. I was originally looking at a Samsung and someone posted in a review this phone as a recommendation. After looking at reviews and watching videos, I decided to take a shot on it. I'm glad I did! So far it works perfectly. I'm on Cricket in the US and have had no problems. I simply removed my sim card from my old phone and put it in my new phone and it worked just fine. I was able to sync everything from my google account and was good to go! So far so good!", "helpfulVotes": 0, "country": "United States", "id": "B07YJNYRTJ-r8", "content_type": "review", "_version_": 1722131204881252352, "asin": "B07YJNYRTJ"}, {"name": "Richard Hunter", "rating_review": 5, "date": "2020-11-16T00:00:00Z", "verified": true, "title_review": "Ordered As A Personal Christmas Gift For Myself", "body": "As of right now, I can't say much of anything about the phone, because I purchased it as a Christmas gift for myself to replace my Galaxy S7, that's starting to mess up. One thing I will say, I love the color. It was described as Orchid gray, but the color I received is actually silver, and that is the color I originally wanted. One more thing, I was surprised at how quick the phone arrived after I placed my order. I guess that's because the seller is in Kentucky and I live in North Carolina.", "helpfulVotes": 0, "country": "United States", "id": "B075ZD2WFN-r2", "content_type": "review", "_version_": 1722131199733792768, "asin": "B075ZD2WFN"}, {"name": "cindy werderitch", "rating_review": 2, "date": "2020-11-10T00:00:00Z", "verified": true, "title_review": "Beyond disappointed", "body": "I am extremely disappointed in this buying experience. Photos to the left are of what I supposedly purchased and photo to the right is what I got. Phone wrapped in bubble wrap, no box, manuals, brand new accessories as stated in description. Some generic cords and nothing else that was supposed to be included. This was purchased as a gift so that is the reason I chose it, so it was in new and presentable condition. Closing the box and sending it back.", "helpfulVotes": 0, "country": "United States", "id": "B01I8V0MJQ-r2", "content_type": "review", "_version_": 1722131197690118144, "asin": "B01I8V0MJQ"}, {"name": "Khadija", "rating_review": 1, "date": "2020-12-20T00:00:00Z", "verified": true, "title_review": "COMPLETE GARBAGE", "body": "I was on the fence for so long about choosing renewed instead of new and God! If i could turn back time I would have paid the extra for new. I got this as a gift for my daughter's christmas gift and I plugged it in to charge 20 minutes ago and it's at 1%. Never again will I give a gift and skim on price.", "helpfulVotes": 0, "country": "United States", "id": "B07C5ZZXDG-r1223", "content_type": "review", "_version_": 1722131203421634560, "asin": "B07C5ZZXDG"}, {"name": "katie", "rating_review": 1, "date": "2021-01-09T00:00:00Z", "verified": true, "title_review": "Terrible- don’t waste your time. Listen to other comments.", "body": "This phone is defective and I am not getting a response when attempting to contact seller. You can’t hear people during phone calls, you have to either have the phone connected to Bluetooth headphones or use speakerphone. Also this pop up keeps coming up and the phone restarts. I bought this as a gift for my mom and it’s not usable due to these problems.", "helpfulVotes": 0, "country": "United States", "id": "B0775MV9K2-r579", "content_type": "review", "_version_": 1722131200491913216, "asin": "B0775MV9K2"}, {"name": "Info Hound", "rating_review": 5, "date": "2021-01-28T00:00:00Z", "verified": true, "title_review": "Purchased as a gift", "body": "I bought this as a gift for someone else. I have a Samsung S20 phone myself (not unlocked and associated with my mobile carrier) and I'm happy with it. I purchased the unlocked version as a gift for someone who didn't want the phone to come preinstalled with the mobile carrier logos and apps.", "helpfulVotes": 0, "country": "United States", "id": "B082XXKZRC-r4", "content_type": "review", "_version_": 1722131205169610752, "asin": "B082XXKZRC"}, {"name": "Tameki Green", "rating_review": 1, "date": "2020-12-24T00:00:00Z", "verified": true, "title_review": "Disappointed", "body": "I bought this phone as a gift for my son. Well the phone programmed fine and I was happy with the purchase until the first day...I tried to call my son and he couldn’t answer because the screen went black. Not even 24 hours after it arrived. I was disappointed.", "helpfulVotes": 0, "country": "United States", "id": "B0775MV9K2-r1765", "content_type": "review", "_version_": 1722131200491913216, "asin": "B0775MV9K2"}, {"name": "pam minor", "rating_review": 1, "date": "2021-01-17T00:00:00Z", "verified": true, "title_review": "Could not activate the phone", "body": "Purchased this product for a Christmas gift for my granddaughter. I took the product to have it activated and the Boost Mobile Customer Service person could not activate the product. Customer serivice told me that the Phone was most likely stolen or locked. I will be reaching out to Amazon for a refund.", "helpfulVotes": 0, "country": "United States", "id": "B0775MV9K2-r1405", "content_type": "review", "_version_": 1722131200491913216, "asin": "B0775MV9K2"}]