[{"name": "Metal_Chips_85", "rating_review": 5, "date": "2018-01-25T00:00:00Z", "verified": true, "title_review": "Hail the creator!", "body": "Before i took the plastic wrap off or even turned it on, i was very impressed by the weight and feel of the Nokia 2. Weighing in at 162 grams, she's got some Gravity in her! It feels good. I bought this phone because; I have owned two Windows Nokia Lumia's. before, and both were excellent! (The Nokia 2 being no exception =D) The advertised battery capacity. A \"Pure\" android operating system. Nokia delivered just that and more! The build quality and feel is beautiful. I bought a white model, and the two tone black metal bezel to the white body is very smooth. The screen, for a 720x1280 res @ 296 Display PPI, looks very good. Nokia states that this is an energy efficient screen. It looks good compared to a Samsung. The performance of the phone is slow. Not fast. Again, Nokia stated that this is an energy efficient CPU. I am a very demanding performance enthusiast! I like fast cars, and Fast computers! That said, i am not disappointed by the phones performance at all. It is a quality Snapdragon CPU, so i am sure it will churn through many tasks very steadily. Using this as a daily driver, along with a more powerful tablet, might be a good strategy to consider for power users. Just saying. I am writing this review about 24 hours after the unboxing, and it is above half battery life since initial charge. And i leaned on the camera and downloaded, installed and configured almost 100 apps. I will be pushing this phone. It accepted a 128gb micro sd card. So, mem is not an issue with the initial 8gb and the Clean and Bloatware Free Android Os allows you to control where you store what. Device could very easily be bootloader unlocked and flashed, if that's your thing. I might try Lineage os at some time, but i see no reason as this is one of the cleanest Android OS's i've ridden so far. Camera doesn't seem to be on par with previous Nokia's with the Carl Zeiss Tessar lens. No problem, its still a great value. And i have yet to get a feel for it. TBD. . . I think this is a great product and just want to shout out to the engineers who put the Nokia 2 on the shelf, you guys are all right in my book.", "helpfulVotes": 18, "country": "United States", "id": "B075FLG6MV-r10", "content_type": "review", "_version_": 1722131221417295872, "asin": "B075FLG6MV"}, {"name": "E.T.", "rating_review": 5, "date": "2018-09-14T00:00:00Z", "verified": true, "title_review": "Very happy with the phone but be careful... (TL;DR: Phone wasn't completely unlocked but I got lucky)", "body": "Phone works great! Got mine from ElectronicDeals. No cracks, scratches, software issues whatsoever. I was honestly really hesitant to buy a refurbished phone but I ended up taking the risk and was not mostly not disappointed. I only had one problem with the phone as a whole: The \"unlocked\" part: When I got the phone I was using MetroPCS but the phone was only half unlocked by Sprint. I was still able to get it activated under Metro and use their service, but signal felt iffy and there was a constant, annoying Sprint OMADM notification in my notification bar. It was out of Metro's hands so I took it to a local Sprint store. They said the only thing they could do was put in a request to get it fully unlocked. They got my number and phone information and I left. Unsatisfied, I decided to try another local Sprint store in the city. The guy at this store said the same thing but he helped me out a bit more. He explained that switching to Sprint would more than likely get rid of notification and improve the service connection. Naturally I was a bit weary about the offer due to being with MetroPCS for long without any problems and he may just be telling me this to make a sale. My worry quickly faded when he told me I would only be paying $25 a month with unlimited everything and I can leave anytime with no strings attached. Like buying the phone in the first place I was hesitant, but ultimately decided to give it a shot. He was right in telling me it would take away the annoying notification and my service is better than ever. Overall, while it all worked out me me in the end, you may want to try to contact the seller before buying just to make sure the phone is 100% unlocked. And if it's not, try to get as much information as possible about so you can unlocked it yourself or at the very least match it up with your current service provider.", "helpfulVotes": 27, "country": "United States", "id": "B07C65MFKH-r8", "content_type": "review", "_version_": 1722131221527396353, "asin": "B07C65MFKH"}, {"name": "Hans K.", "rating_review": 5, "date": "2015-11-20T00:00:00Z", "verified": true, "title_review": "Great \"entry level\" phone", "body": "Great \"entry level\" phone. I use quotes because to be flat out honest, this is pretty much everything most people need in a phone. Yes, there are some folks out there who need to have the latest and greatest devices, but this one probably takes care of most 80% of smartphone users out there. The finish and backing on the phone are made out of great materials. The backing is a slight rubberized material and doesn't slide off tables or in your hand. My friend has a Motorola Nexus 6 phone which is several hundreds more than this one, and the phone is pretty similar in build and finish. The Verizon model of this phone, in particular, is great because there are some simple workarounds for those who are computer/tech savvy to get the GSM slot of this phone unlocked for use on ATT and T-Mobile. Do a quick google search on \"Moto E Verizon GSM unlock\" and that should get you started. I struggled with it a little bit, but after about 30 minutes I was able to get it unlocked and used it with Cricket Wireless. 4G LTE data was occasionally inconsistent, however. Overall a great device with screen size and form similar to that of an iPhone 5. One frustrating thing about later versions of Android is the inability for apps to read/write on to your SD card (since Kitkat, I believe). I frequently listen to podcasts using the BeyondPod app, which downloads MP3s directly to the phone now, instead of on my SD card, because of the limitations on the Android OS. Still a great phone at a tremendous value, if you can get these during occasional sales at around $40.", "helpfulVotes": 11, "country": "United States", "id": "B00SIE2YQ8-r1", "content_type": "review", "_version_": 1722131220744110080, "asin": "B00SIE2YQ8"}, {"name": "TheHonestshopper", "rating_review": 5, "date": "2018-02-05T00:00:00Z", "verified": true, "title_review": "Great phone at a great price", "body": "Ok. Where do I begin. The battery oh.... The battery!!! A 3,900 mAh offering good for 2 days on a moderate to heavy usage. I simply have too say; I started at 8:30am at 100% and it is currently 7:51pm on February 5th when I'm doing this review and I have 56% left, with close to 4hrs ost(on-screen-time)with some web browsing, listening to music, lots of texting, no games, no videos, brightness at about 20%. The performance is above average, at 3 yrs old still in 2018 this thing is a BEAST going strong with lots of fluidity and no lags once so ever!!! Apps open up quick with ease. Build quality is study, but when you turn it over there when u discover heaven. Has a very unique design that feels good in the hands made from a fabric called \"ballistic nylon supposed to be very strong and sturdy and so far it's stands by its claim. A 21 mp camera that takes decent pictures in good light, not recommended in low light but if you can get the updates up and going that should take care of the cameras software. Very good camera nonetheless. Here are some ratings that hopefully help you guys out to buy this phone 👇👇 PERFORMANCE: 9.5/10 BATTERY:10/10👍👍(almost 2 days on a single charge) BUILD:8/10(great feel) CAMERA: 8.5/10 (21mp)", "helpfulVotes": 27, "country": "United States", "id": "B00OZTSY6Y-r0", "content_type": "review", "_version_": 1722131221189754880, "asin": "B00OZTSY6Y"}, {"name": "Cyde Weys", "rating_review": 5, "date": "2013-05-28T00:00:00Z", "verified": true, "title_review": "A great phone", "body": "I upgraded from the Nexus S 4G on Sprint, which is several generations old now, and this is a large improvement. My main concern was that it wasn't going to fit in my pockets (I'm an adult male who wears standard jeans), but it fits easily. The reason it fits so well is that it's a lot slimmer than my old Nexus S. So that's not a worry. Everything on the phone works great. It's blazingly fast. I can finally play Temple Run 2 without intermittent stutter (which is a death sentence in that game). Just a tip though, trash the Sprint and Samsung apps and stick with the Google ones. There's no reason to use the Samsung mail app over Google's Gmail app, and the Sprint and Samsung app stores are just pathetic. S Health is a cool idea. I love having a pedometer always on in my pocket. I don't know if it's actually making me walk more than I otherwise would, but it's fun to have metrics on it at least. Unlike other people I don't have any complaints about the phone's aesthetics whatsoever. I like that it's plastic. Plastic is an amazing material that's not as fragile as glass (cough cough iPhone 4) and is lighter than metal. I also find it awesome that my phone shipped with a link to install BaconReader (a mobile app for Reddit) on one of the home screens. Someone at Sprint must be a Redditor.", "helpfulVotes": 16, "country": "United States", "id": "B00CEKXJ3Y-r292", "content_type": "review", "_version_": 1722131221048197120, "asin": "B00CEKXJ3Y"}, {"name": "Les H", "rating_review": 5, "date": "2019-03-28T00:00:00Z", "verified": true, "title_review": "A great phone from a great seller!", "body": "I researched the iPhone 6,7, and 8 as replacements for my aging 5s. I also sought out sellers with good ratings for this purchase. I settled on MyWit based on their reviews and their volume of sales. The phone arrived a day early and it is absolutely pristine. If it is a refurb, there are zero signs of that as there are no marks anywhere on it. Not even finger prints or dust. It came with a nice flex lighting cable and Apple charger (no sim as advertised). I put the sim card from my old iPhone 5s in it and went through the setup questions. I had a fully functional iPhone 8 in 5 minutes tops. I selected the iPhone 8 over the 6 or 7 due to the advanced technology in the 8. It is worth the extra $100 over the same size 7. It is fast but the battery lasts all day without showing significant signs of needing a charge. I also purchased a Speck Candy Shell case for this phone. The iPhone 8 has a glass back for wireless charging and it is very smooth and slick to hold. With my dry fingers, it is difficult to even use the phone so a case is necessary to give it some grip. The Speck case is a perfect, anti-slip and lots of drop and screen protection. See this case here https://www.amazon.com/Speck-Products-CandyShell-Phone-iPhone/dp/B01K094IZ8 Very pleased with the seller too and I would certainly use them for another phone purchase without question!", "helpfulVotes": 109, "country": "United States", "id": "B07753NSQZ-r0", "content_type": "review", "_version_": 1722131221509570560, "asin": "B07753NSQZ"}, {"name": "Amazon Customer", "rating_review": 5, "date": "2018-06-30T00:00:00Z", "verified": true, "title_review": "Sweet Phone", "body": "I love this phone. At first I did not think I would be able to get used to a new phone. I had been using my Galaxy 5 forever and it was in pretty rough shape. Still I really liked it. I decided it was time to up grade. I read the reviews of the seller. Good reviews. The phone is sleek and smooth. The 8 plus is a bit larger than what I am used to. However I like the extra length. The camera is amazing and has some pretty cool features. Slow motion is awesome for video. There are some features, like Bixby that are pre installed on the phone and also Samsung web. When opening gmail there is only the option to open the links up on Samsung web. I am sure this can be changed, but tricky. I do not care for either feature and would rather choose my settings. When you swipe all the way to the left, this Bixby is on your phone. Apparently it is a point system by Samsung. It seems to be ending though, so possibly it will be uninstalled. Over all great phone especially refurbished. Will note that mine did not come with the original charger. This seems to be an isolated case, as most people said theirs did. I have a Samsung dock, and the type c charger will still fit. Good phone very happy. Arrived quickly too!", "helpfulVotes": 49, "country": "United States", "id": "B076HVSJQR-r7", "content_type": "review", "_version_": 1722131221505376256, "asin": "B076HVSJQR"}, {"name": "Richard", "rating_review": 5, "date": "2014-11-20T00:00:00Z", "verified": true, "title_review": "AMAZING! VERY HAPPY!", "body": "Wow! Is this battery every going to die? I didn't expect the phone to be this good, but then again it's a Droid. I have owned all the Droid models except for the Droid 3 & 4. Waving your hand over the phone to check messages, indicators, calls, etc, is amazing. Buttons....what buttons! Screen is amazing. Speed is insane. This is faster than my computer. The red sticks out and is an attention grabber. Very good quality, well built. Motorola did an outstanding job. I bought this to avoid a new contract and from losing my unlimited plan. If you are considering this phone you won't be disappointed. I am not! Oh, and being able to speak and have your phone do whatever you want is pretty cool. And let's not forget this phone has wireless qi charging built it. All you need to do is purchase a good quality qi charger. I purchased an eco model built for the Turbo. And finally, the phone will ask if you want to protect via Motorola's phone finder app. If you say yes it will take care of the rest. If you ever lose or misplace your phone or need to \"wipe\" it, or trigger the alarm, etc, you go to Motorola's website and follow the instructions. Pretty cool indeed. Very happy.", "helpfulVotes": 17, "country": "United States", "id": "B00OZTSY6Y-r413", "content_type": "review", "_version_": 1722131221189754880, "asin": "B00OZTSY6Y"}, {"name": "Goku", "rating_review": 5, "date": "2019-04-16T00:00:00Z", "verified": true, "title_review": "Best phone for the price by far", "body": "I am absolutely impressed with this phone. The screen quality and definition is amazing! Watching movies with the 21:9 aspect ratio is really nice. So far, using this phone has been very responsive and great. I love the fact that it supports an SD card and works on the Verizon network. I have not experienced any slowdowns or lagging. Tested a few games without issues. The camera quality is quite good. I'd say at this price point, you can't beat the quality. It truly does feel like a flagship phone due to the optimizations that have been done to the Android OS. The pop out menu for one handed mode is a nice feature as well. Also, the battery life has held up really nicely. I get a full day's usage out of mine. The form factor is the only thing that takes some getting used to, but it makes using the phone much nicer for reading or watching videos. On standard 16:9 videos you can pinch to zoom if you would like it without black bars. This is done pretty seamlessly. Overall 10/10 for this price. I love the stylish look and design of the device. I do highly recommend this phone. I've upgraded from an LG V20 and I'm not looking back any time soon.", "helpfulVotes": 40, "country": "United States", "id": "B07MZ2TRTC-r3", "content_type": "review", "_version_": 1722131221582970880, "asin": "B07MZ2TRTC"}, {"name": "jobo", "rating_review": 5, "date": "2018-02-10T00:00:00Z", "verified": true, "title_review": "Pleased to say this battery life is just as good", "body": "This is my first android, getting use to that operating system. Switched from a Nokia windows phone that I stuck with too long, but was hesitant to switch because the battery lasted 8 or ten days, See so many people who's phone won't last a day and didn't want to be hostage to a charging ball and chain. Pleased to say this battery life is just as good, maybe better. My usage habits are leaving Bluetooth on as it links to both car and home phone. Leave the location on to keep the phone unlocked at home. Wi fi and data as needed. Average day maybe three calls and eight or ten texts, but I get a solid eight days on a charge. Happy with that. AT&T doesn't advertise it but this can be used as a go phone for about $8 a month or as a back up, and easy to switch in and out of full plans, just log in to you account. Main thing that forced a switch is our summer house has spotty cellular service and this does Wi-Fi calling that old phones didn't. It may be that this gets better cell reception and won't need that, but the Wi-Fi calling works great. Can't say enough about how this fits my needs for under a hundred bucks.", "helpfulVotes": 18, "country": "United States", "id": "B075FLG6MV-r47", "content_type": "review", "_version_": 1722131221417295872, "asin": "B075FLG6MV"}]