[
  {
    "name": "Dan Grondin",
    "rating_review": 5,
    "date": "2017-08-02T00:00:00Z",
    "verified": true,
    "title_review": "Good phone, great seller, shopcelldeals.",
    "body": "Nice phone. Great for the money. Rear camera is poor quality but not bad for snap shots, The seller, shopcelldeals, was great to deal with. i had a problem with my screen. they responded to me right away and got me a return authorization. I bought another from them and this one works great. i would highly recommend them.",
    "helpfulVotes": 11,
    "country": "United States",
    "id": "B06XS2GWFC-r8",
    "content_type": "review",
    "_version_": 1722051567707750400,
    "asin": "B06XS2GWFC"
  },
  {
    "name": "Matt",
    "rating_review": 5,
    "date": "2019-05-29T00:00:00Z",
    "verified": true,
    "title_review": "Great value. Good phone. Works on AT&T",
    "body": "Only had 1 day but initial impressions are great. Have AT&T, no issues connecting or with calls/texts or updates. Switched from S8+ and it's definitely a step up, although the UI is just different enough to take some getting used to. Camera is great. Most Importantly: it works with AT&T plug and play, removed SIM from old phone and or into Pixel 3xl and it picked right up. No issues! Call/text/mms functioning No Verizon icon on boot screen All apps work System updates no problem Phone was last fully charged 104 days ago Has minor scratch on screen and in corners, annoying, but worth not paying full price for",
    "helpfulVotes": 14,
    "country": "United States",
    "id": "B07HKPMFZ5-r17",
    "content_type": "review",
    "_version_": 1722051567305097216,
    "asin": "B07HKPMFZ5"
  },
  {
    "name": "Insert name here.",
    "rating_review": 5,
    "date": "2017-08-13T00:00:00Z",
    "verified": true,
    "title_review": "Great budget phone",
    "body": "Last phone I had was a Samsung galaxy s3 and it was pretty good but was really showing it's age. Got very slow towards the end and never had good battery life. This phone is fast. Everything runs smooth. The screen is bright and best of all the battery is a monster. It can last over an entire day on a single charge. Now this phone doesn't have all the little novelty things that an s series has but I personally have never used most of those things even once with my s3. It does have all the essentials for the most part and is very quick. I've never experienced any lag between menus or anything. There are only a couple things I was disappointed to find out about this phone. One it doesn't have a light sensor to adjust screen brightness on the fly and two it doesn't have a notification led on the face of the phone. I can understand the lack of a light sensor to keep costs down but really they couldn't spring for the .20 cent led? As a side note Verizon service is so much better.",
    "helpfulVotes": 11,
    "country": "United States",
    "id": "B06XS2GWFC-r14",
    "content_type": "review",
    "_version_": 1722051567707750400,
    "asin": "B06XS2GWFC"
  },
  {
    "name": "F.H",
    "rating_review": 5,
    "date": "2018-10-18T00:00:00Z",
    "verified": true,
    "title_review": "Overall a Great Phone",
    "body": "Pros: 1. The screen is ABSOLUTE GORGEOUS, I own Samsung Note 9 and Xs Max, the screen on this Sony is unbeatable. Sony used a newer technology to produce their screen and it is looking fantastic. 2. Doesn't wobble that much on the desk comparing to XZ2. 3. VoLTE is working for T-Mobile (I wan't able to test on other carriers). 4. Comes with Android 9 out of the box. 5. Front facing camera is amazing with much clearer pictures comparing to XZ2, even better than Xs Max. 6. Very sleek design and it has NO NOTCH!! 7. Front facing speakers sounds really good comparing to Note 9. 8. Dedicated camera button instead of a Bixby button. Cons: 1. Fingerprint scanner is still a bit awkwardly placed. 2. Even though it comes with Android 9, the gesture control like on the new Pixel 3 phones is removed. (I personally don't care since the gesture control is really awkward anyway) 3. Even though it packs a 3300mAh battery, I have less battery percentage after a day of use comparing to Xs Max, but it does hold me through a day. (I have 6 hours of screen on time; I watch YouTube videos, play games, and scroll through social media apps like Facebook and Instagram.) 4. Headphone jack is gone forever for flagship phones from Sony (I use their bluetooth headphones and LDAC is great on playing my FLAC files through bluetooth, so it isn't an issue for me.) Conclusion: This is really a great phone from Sony. They improved this phone from XZ2 in all of the aspects. Awesome display, great front facing speakers, and great cameras. The battery life is average to good comparing to other flagships in 2018, but it still is able to hold me through a day, so I have so complaints here. Sony is the only company out there still adding a dedicated camera button, and I have to say, I love it. If you are looking out there for a great phone from Sony, this is a really nice option even if it costs $900 (I pre-ordered it with the Ear Duo bundle, but I would still buy it for $900 for phone only).",
    "helpfulVotes": 90,
    "country": "United States",
    "id": "B07H6V8TB9-r0",
    "content_type": "review",
    "_version_": 1722051568129277952,
    "asin": "B07H6V8TB9"
  },
  {
    "name": "Ashley A",
    "rating_review": 5,
    "date": "2017-09-28T00:00:00Z",
    "verified": true,
    "title_review": "Great!",
    "body": "Pretty happy with my purchase. I broke my S7 Edge and wanted another one. Verizon has new ones for around 750, but 350 refurbished is a great deal. Very very little wear around the home button and that's it. Connected to Verizon through my already existing sim card. Works great so far.",
    "helpfulVotes": 17,
    "country": "United States",
    "id": "B077YTCMH9-r49",
    "content_type": "review",
    "_version_": 1722051567964651520,
    "asin": "B077YTCMH9"
  },
  {
    "name": "Tawana",
    "rating_review": 5,
    "date": "2019-07-01T00:00:00Z",
    "verified": true,
    "title_review": "Samsung A10 - So far so good",
    "body": "Bought this phone for my mum in living in Jamaica. The camera is good and it is very lightweight. Will update review after a few days/weeks use",
    "helpfulVotes": 55,
    "country": "United States",
    "id": "B07SCJNSRT-r0",
    "content_type": "review",
    "_version_": 1722051568277127168,
    "asin": "B07SCJNSRT"
  },
  {
    "name": "REBECCA",
    "rating_review": 5,
    "date": "2021-07-16T00:00:00Z",
    "verified": true,
    "title_review": "Great purchase!",
    "body": "Packing was nice, phone looks brand new works great so far. Happy with my purchase. Love the warrenty as well cause you never know when buying a used phone. Was so scared to purchase but I did so far happy.",
    "helpfulVotes": 20,
    "country": "United States",
    "id": "B011SDYBZW-r5",
    "content_type": "review",
    "_version_": 1722051567264202752,
    "asin": "B011SDYBZW"
  },
  {
    "name": "Mike L.",
    "rating_review": 5,
    "date": "2015-08-19T00:00:00Z",
    "verified": true,
    "title_review": "Great Deal",
    "body": "This phone works flawlessly, and looks and works as if it was brand new (and not refurbished). This was a much cheaper route of getting a replacement phone after accidentally breaking my original S5, all I had to do was take my sim card out of the original and plug it into the replacement.",
    "helpfulVotes": 187,
    "country": "United States",
    "id": "B016WYTYFE-r5",
    "content_type": "review",
    "_version_": 1722051567566192640,
    "asin": "B016WYTYFE"
  },
  {
    "name": "Young at heart, Deb",
    "rating_review": 5,
    "date": "2019-01-04T00:00:00Z",
    "verified": true,
    "title_review": "Great phone!",
    "body": "I purchased this phone for my husband after his older model phone died. I knew this S7 edge was a great phone because we already own 3 of them. I had never purchased an unlocked phone prior to this one and I was more than a little nervous. The phone arrived and was in excellent condition. It looked brand new. But, more importantly, it worked great! My husband travels across the country and his phone must work well. I would definitely buy another one.",
    "helpfulVotes": 58,
    "country": "United States",
    "id": "B01NB1KG8U-r0",
    "content_type": "review",
    "_version_": 1722051567636447232,
    "asin": "B01NB1KG8U"
  },
  {
    "name": "adam3178",
    "rating_review": 5,
    "date": "2019-05-18T00:00:00Z",
    "verified": true,
    "title_review": "Great Phone!",
    "body": "I bought this phone on a whim when my other phone had broken. Many people say not to buy refurbished electronics, but I am very happy with my purchase. This phone is close to immaculate! the only signs of use are near the charging port where there is a little bit of scuffing. Another plus of my purchase was that the phone came with a pre-installed tempered glass screen protector, as well as a charging cord, and the charging block itself. The jet black color is in amazing condition for this phone being refurbished.",
    "helpfulVotes": 19,
    "country": "United States",
    "id": "B06XS3CTJM-r3",
    "content_type": "review",
    "_version_": 1722051567806316544,
    "asin": "B06XS3CTJM"
  }
]
